
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 28 to add, 3 to change, 22 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.subscription_powerplatform_primary_key[0]
  * azurerm_key_vault_secret.subscription_powerplatform_secondary_key[0]
  * azurerm_key_vault_secret.subscription_smoketest_primary_key[0]
  * azurerm_key_vault_secret.subscription_smoketest_secondary_key[0]
  * module.ams_api[0].azurerm_api_management_product_api.link_to_product[0]
  * module.pre-api-mgmt-api-policy[0].azurerm_api_management_api_policy.api_policy
* Update
  * module.ams_product[0].azurerm_api_management_product.product
  * module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription
  * module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription
* Replace
  * azurerm_key_vault_secret.API_POSTGRES_DATABASE
  * azurerm_key_vault_secret.API_POSTGRES_HOST
  * azurerm_key_vault_secret.API_POSTGRES_PASS
  * azurerm_key_vault_secret.API_POSTGRES_PORT
  * azurerm_key_vault_secret.API_POSTGRES_USER
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PASS
  * azurerm_key_vault_secret.POSTGRES_USER
  * azurerm_key_vault_secret.apim_subscription_powerplatform_primary_key[0]
  * azurerm_key_vault_secret.apim_subscription_powerplatform_secondary_key[0]
  * azurerm_key_vault_secret.apim_subscription_smoketest_primary_key[0]
  * azurerm_key_vault_secret.apim_subscription_smoketest_secondary_key[0]
  * azurerm_key_vault_secret.appinsights-non-prod-key[0]
  * azurerm_key_vault_secret.dg_password[0]
  * azurerm_key_vault_secret.dg_password[1]
  * azurerm_key_vault_secret.dg_username[0]
  * azurerm_key_vault_secret.dg_username[1]
  * azurerm_key_vault_secret.edit_password[0]
  * azurerm_key_vault_secret.edit_username[0]
  * azurerm_key_vault_secret.finalsa_storage_account_connection_string
  * azurerm_key_vault_secret.ingestsa_storage_account_connection_string
  * azurerm_key_vault_secret.sa_storage_account_connection_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.API_POSTGRES_DATABASE must be replaced
-/+ resource "azurerm_key_vault_secret" "API_POSTGRES_DATABASE" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-DATABASE/07ffca259d5b4ddcb0fbc6d1d7a05ab6" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "api-POSTGRES-DATABASE"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/api-POSTGRES-DATABASE/versions/07ffca259d5b4ddcb0fbc6d1d7a05ab6" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/api-POSTGRES-DATABASE" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "07ffca259d5b4ddcb0fbc6d1d7a05ab6" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-DATABASE" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.API_POSTGRES_HOST must be replaced
-/+ resource "azurerm_key_vault_secret" "API_POSTGRES_HOST" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-HOST/cff2718833c3491a8030a965a4dd185d" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "api-POSTGRES-HOST"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/api-POSTGRES-HOST/versions/cff2718833c3491a8030a965a4dd185d" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/api-POSTGRES-HOST" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "cff2718833c3491a8030a965a4dd185d" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-HOST" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.API_POSTGRES_PASS must be replaced
-/+ resource "azurerm_key_vault_secret" "API_POSTGRES_PASS" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-PASS/39a094c5c6d9491aae43b17732646673" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "api-POSTGRES-PASS"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/api-POSTGRES-PASS/versions/39a094c5c6d9491aae43b17732646673" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/api-POSTGRES-PASS" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "4f710f5bbf60400383c935d289375a70" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-PASS" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.API_POSTGRES_PORT must be replaced
-/+ resource "azurerm_key_vault_secret" "API_POSTGRES_PORT" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-PORT/005a9be858e8446e96e961a762515afd" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "api-POSTGRES-PORT"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/api-POSTGRES-PORT/versions/005a9be858e8446e96e961a762515afd" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/api-POSTGRES-PORT" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "005a9be858e8446e96e961a762515afd" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-PORT" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.API_POSTGRES_USER must be replaced
-/+ resource "azurerm_key_vault_secret" "API_POSTGRES_USER" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-USER/1a1aa330f774457cb8d38c8c62bd7fd8" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "api-POSTGRES-USER"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/api-POSTGRES-USER/versions/1a1aa330f774457cb8d38c8c62bd7fd8" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/api-POSTGRES-USER" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "1a1aa330f774457cb8d38c8c62bd7fd8" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/api-POSTGRES-USER" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/postgresdb-host/164633b4779747748f55bb6cf513c7cb" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "postgresdb-host"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-host/versions/164633b4779747748f55bb6cf513c7cb" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-host" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "164633b4779747748f55bb6cf513c7cb" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/postgresdb-host" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PASS must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_PASS" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/postgresdb-password/1b9bcb6b30ab42b1a70719fe13466b10" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "postgresdb-password"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-password/versions/1b9bcb6b30ab42b1a70719fe13466b10" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "1b9bcb6b30ab42b1a70719fe13466b10" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/postgresdb-password" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_USER must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_USER" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/postgresdb-username/3b8ba020342b4e9abce5ea785b00496a" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "postgresdb-username"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-username/versions/3b8ba020342b4e9abce5ea785b00496a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-username" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "3b8ba020342b4e9abce5ea785b00496a" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/postgresdb-username" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.apim_subscription_powerplatform_primary_key[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "apim_subscription_powerplatform_primary_key" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/apim-sub-powerplatform-primary-key/21816feaca8f4c329313fc492d745203" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "apim-sub-powerplatform-primary-key"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/apim-sub-powerplatform-primary-key/versions/21816feaca8f4c329313fc492d745203" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/apim-sub-powerplatform-primary-key" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "21816feaca8f4c329313fc492d745203" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/apim-sub-powerplatform-primary-key" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.apim_subscription_powerplatform_secondary_key[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "apim_subscription_powerplatform_secondary_key" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/apim-sub-powerplatform-secondary-key/1d0db696909241c0848435e3ccb2ac50" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "apim-sub-powerplatform-secondary-key"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/apim-sub-powerplatform-secondary-key/versions/1d0db696909241c0848435e3ccb2ac50" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/apim-sub-powerplatform-secondary-key" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "1d0db696909241c0848435e3ccb2ac50" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/apim-sub-powerplatform-secondary-key" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.apim_subscription_smoketest_primary_key[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "apim_subscription_smoketest_primary_key" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/apim-sub-smoketest-primary-key/513176b21a764159a87ce363b4cf8f14" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "apim-sub-smoketest-primary-key"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/apim-sub-smoketest-primary-key/versions/513176b21a764159a87ce363b4cf8f14" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/apim-sub-smoketest-primary-key" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "513176b21a764159a87ce363b4cf8f14" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/apim-sub-smoketest-primary-key" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.apim_subscription_smoketest_secondary_key[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "apim_subscription_smoketest_secondary_key" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/apim-sub-smoketest-secondary-key/a1823ab9a97c46068596e4bae216493b" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "apim-sub-smoketest-secondary-key"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/apim-sub-smoketest-secondary-key/versions/a1823ab9a97c46068596e4bae216493b" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/apim-sub-smoketest-secondary-key" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "a1823ab9a97c46068596e4bae216493b" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/apim-sub-smoketest-secondary-key" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.appinsights-non-prod-key[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "appinsights-non-prod-key" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/AppInsightsInstrumentationKey/068b803e37bc46b6aca7cd28df7a06e5" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "AppInsightsInstrumentationKey"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/AppInsightsInstrumentationKey/versions/068b803e37bc46b6aca7cd28df7a06e5" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/AppInsightsInstrumentationKey" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "068b803e37bc46b6aca7cd28df7a06e5" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/AppInsightsInstrumentationKey" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.dg_password[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "dg_password" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/dg1-password/c676ad2b8d9d435db65bc7ad3162e2ad" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "dg1-password"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/dg1-password/versions/c676ad2b8d9d435db65bc7ad3162e2ad" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/dg1-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "c676ad2b8d9d435db65bc7ad3162e2ad" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/dg1-password" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.dg_password[1] must be replaced
-/+ resource "azurerm_key_vault_secret" "dg_password" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/dg2-password/f9209fd1712e4195b2f614f5a3b94401" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "dg2-password"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/dg2-password/versions/f9209fd1712e4195b2f614f5a3b94401" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/dg2-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "f9209fd1712e4195b2f614f5a3b94401" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/dg2-password" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.dg_username[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "dg_username" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/dg1-username/184ac85413664a98a57ba346c69632f9" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "dg1-username"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/dg1-username/versions/184ac85413664a98a57ba346c69632f9" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/dg1-username" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "184ac85413664a98a57ba346c69632f9" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/dg1-username" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.dg_username[1] must be replaced
-/+ resource "azurerm_key_vault_secret" "dg_username" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/dg2-username/d7ad879f47744c0dbd6dfb64bb3fde04" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "dg2-username"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/dg2-username/versions/d7ad879f47744c0dbd6dfb64bb3fde04" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/dg2-username" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "d7ad879f47744c0dbd6dfb64bb3fde04" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/dg2-username" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.edit_password[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "edit_password" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/videditvm1-password/e896cfda11df4c39b4d60254e793e597" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "videditvm1-password"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/videditvm1-password/versions/e896cfda11df4c39b4d60254e793e597" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/videditvm1-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "e896cfda11df4c39b4d60254e793e597" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/videditvm1-password" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.edit_username[0] must be replaced
-/+ resource "azurerm_key_vault_secret" "edit_username" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/videditvm1-username/d57d3a9c2a9a47d28aea2f01b7c1f4ad" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "videditvm1-username"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/videditvm1-username/versions/d57d3a9c2a9a47d28aea2f01b7c1f4ad" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/videditvm1-username" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "d57d3a9c2a9a47d28aea2f01b7c1f4ad" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/videditvm1-username" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.finalsa_storage_account_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "finalsa_storage_account_connection_string" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/finalsa-storage-account-connection-string/52d05b6b8ba34b4e83a5122ccbe1b51b" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "finalsa-storage-account-connection-string"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/finalsa-storage-account-connection-string/versions/52d05b6b8ba34b4e83a5122ccbe1b51b" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/finalsa-storage-account-connection-string" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "52d05b6b8ba34b4e83a5122ccbe1b51b" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/finalsa-storage-account-connection-string" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.ingestsa_storage_account_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "ingestsa_storage_account_connection_string" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/ingestsa-storage-account-connection-string/39f0086cdf23440b9cda0e9325303759" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "ingestsa-storage-account-connection-string"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/ingestsa-storage-account-connection-string/versions/39f0086cdf23440b9cda0e9325303759" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/ingestsa-storage-account-connection-string" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "39f0086cdf23440b9cda0e9325303759" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/ingestsa-storage-account-connection-string" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.sa_storage_account_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "sa_storage_account_connection_string" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/sa-storage-account-connection-string/20ae235697914f33be14bf9a96901979" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" # forces replacement
        name                    = "sa-storage-account-connection-string"
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/sa-storage-account-connection-string/versions/20ae235697914f33be14bf9a96901979" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/sa-storage-account-connection-string" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "20ae235697914f33be14bf9a96901979" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/sa-storage-account-connection-string" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.subscription_powerplatform_primary_key[0] will be created
  + resource "azurerm_key_vault_secret" "subscription_powerplatform_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "apim-sub-powerplatform-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.subscription_powerplatform_secondary_key[0] will be created
  + resource "azurerm_key_vault_secret" "subscription_powerplatform_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "apim-sub-powerplatform-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.subscription_smoketest_primary_key[0] will be created
  + resource "azurerm_key_vault_secret" "subscription_smoketest_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "apim-sub-smoketest-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.subscription_smoketest_secondary_key[0] will be created
  + resource "azurerm_key_vault_secret" "subscription_smoketest_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "apim-sub-smoketest-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.ams_api[0].azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + product_id          = "pre-api"
      + resource_group_name = "ss-stg-network-rg"
    }

  # module.ams_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pre-api"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/126dc7da-b3a6-4b30-a8c1-706ca2ffeb35"
        # (7 unchanged attributes hidden)
    }

  # module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/daa39986-06b3-4656-be29-f9dde647e13e"
        # (7 unchanged attributes hidden)
    }

  # module.pre-api-mgmt-api-policy[0].azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="https://pre-api.staging.platform.hmcts.net" />
                    <cors allow-credentials="false">
                        <allowed-origins>
                            <origin>*</origin>
                        </allowed-origins>
                        <allowed-methods>
                            <method>*</method>
                        </allowed-methods>
                        <allowed-headers>
                            <header>*</header>
                        </allowed-headers>
                    </cors>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

Plan: 28 to add, 3 to change, 22 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":694,"Program":"tfcmt","SHA1":"","Vars":{}} -->